miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_clibusbip.c
/******************************************************************************
 Function Name   : usb_set_event
 Description     : Set event.
 Arguments       : uint16_t     event       : event code.
                 : usb_ctrl_t   *p_ctrl     : control structure for USB API.
 Return value    : none
 ******************************************************************************/
void usb_set_event (uint16_t event, usb_ctrl_t *p_ctrl)
{
#if (BSP_CFG_RTOS_USED == 1)
    static uint16_t     count = 0;

    p_ctrl->event = event;
    g_usb_cstd_event[count] = *p_ctrl;

    switch (event)
    {
        case    USB_STS_DEFAULT :
        case    USB_STS_CONFIGURED :     
        case    USB_STS_BC :
        case    USB_STS_OVERCURRENT :
        case    USB_STS_NOT_SUPPORT :
            (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_OFF);
        break;  

        case    USB_STS_DETACH :
            if (USB_HOST == g_usb_usbmode)
            {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_OFF);
                if (g_usb_semaphore_holder[p_ctrl->module] == p_ctrl->address)
                {
                    usb_cstd_rel_semaphore(p_ctrl);
                }
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
            }
            else
            {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_OFF);
                usb_cstd_rel_semaphore(p_ctrl);
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
            }
        break;
 
        case    USB_STS_REQUEST :
            (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_ON);
        break;

        case    USB_STS_SUSPEND :
            if (USB_HOST == g_usb_usbmode)
            {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], g_usb_cur_task_hdl[p_ctrl->module], USB_OFF);
                usb_cstd_rel_semaphore(p_ctrl);
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
            }
            else
            {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_OFF);
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
            }
        break;

        case    USB_STS_RESUME :
            if (USB_HOST == g_usb_usbmode)
            {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], g_usb_cur_task_hdl[p_ctrl->module], USB_OFF);
                usb_cstd_rel_semaphore(p_ctrl);
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
            }
            else
            {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_OFF);
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
            }
        break;

        case    USB_STS_REQUEST_COMPLETE :
            if (USB_HOST == g_usb_usbmode)
            {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
                (*g_usb_apl_callback)(&g_usb_cstd_event[count], g_usb_cur_task_hdl[p_ctrl->module], USB_OFF);
                usb_cstd_rel_semaphore(p_ctrl);
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
            }
            else
            {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
                if (0 == p_ctrl->setup.length)
                {
                    /* Processing for USB request has the no data stage */
                    (*g_usb_apl_callback)(&g_usb_cstd_event[count], (usb_hdl_t)USB_NULL, USB_OFF);
                }
                else
                {
                    /* Processing for USB request has the data state */
                    (*g_usb_apl_callback)(&g_usb_cstd_event[count], g_usb_cur_task_hdl[p_ctrl->module], USB_OFF);
                    usb_cstd_rel_semaphore(p_ctrl);
                }
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */
            }
        break;

        case    USB_STS_READ_COMPLETE :
        case    USB_STS_WRITE_COMPLETE :
#if defined(USB_CFG_HMSC_USE)       
        case    USB_STS_MSC_CMD_COMPLETE:
#endif /* defined(USB_CFG_HMSC_USE) */
            (*g_usb_apl_callback)(&g_usb_cstd_event[count], g_usb_cur_task_hdl[p_ctrl->module], USB_OFF);
            usb_cstd_rel_semaphore(p_ctrl);
        break;

        default :
            /* Do Nothing */
        break;
    }

    count = ((count + 1) % USB_EVENT_MAX);
#else /* (BSP_CFG_RTOS_USED == 1) */
    g_usb_cstd_event.code[g_usb_cstd_event.write_pointer] = event;
    g_usb_cstd_event.ctrl[g_usb_cstd_event.write_pointer] = *p_ctrl;
    g_usb_cstd_event.write_pointer++;
    if (g_usb_cstd_event.write_pointer >= USB_EVENT_MAX)
    {
        g_usb_cstd_event.write_pointer = 0;
    }
#endif /*(BSP_CFG_RTOS_USED == 1)*/
} /* End of function usb_set_event() */


#if (BSP_CFG_RTOS_USED == 1)
/******************************************************************************
 Function Name   : usb_cstd_get_semaphore
 Description     : Getting semaphore processing for the thread safe function
 Arguments       : usbip_no     : USB Module Number (0 or 1)
 Return value    : usb_er_t     : USB_OK / USB_ERROR
 ******************************************************************************/
usb_err_t usb_cstd_get_semaphore (usb_ctrl_t *p_ctrl)
{
#if (USB_CFG_MULTIPLE_TASKS == USB_CFG_ENABLE)
    BaseType_t      retval = pdFAIL;
    uint8_t         usbip_no = p_ctrl->module;

    retval = xSemaphoreTake(g_usb_semaphore_hdl[usbip_no], USB_TMO_VAL);

    if (pdPASS == retval)
    {
        g_usb_cur_task_hdl[usbip_no] = xTaskGetCurrentTaskHandle();
        g_usb_semaphore_holder[usbip_no] = p_ctrl->address;
        return USB_SUCCESS;
    }

    return USB_ERR_NG;
#else   /* (USB_CFG_MULTIPLE_TASKS == USB_CFG_ENABLE) */
    return USB_SUCCESS;
#endif  /* (USB_CFG_MULTIPLE_TASKS == USB_CFG_ENABLE) */
}
/******************************************************************************
 End of function usb_cstd_get_semaphore
 ******************************************************************************/

