miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_clibusbip.c
/******************************************************************************
 Function Name   : usb_cstd_rel_semaphore
 Description     : Releasing semaphore processing for the thread safe function
 Arguments       : usbip_no     : USB Module Number (0 or 1)
 Return value    : usb_er_t     : USB_OK / USB_ERROR
 ******************************************************************************/
usb_err_t usb_cstd_rel_semaphore (usb_ctrl_t *p_ctrl)
{
#if (USB_CFG_MULTIPLE_TASKS == USB_CFG_ENABLE)
    BaseType_t      retval = pdFAIL;
    uint8_t         usbip_no = p_ctrl->module;

    if ((UBaseType_t)0 == uxSemaphoreGetCount(g_usb_semaphore_hdl[usbip_no]))
    {
        retval = xSemaphoreGive(g_usb_semaphore_hdl[usbip_no]);
    }

    if (pdPASS == retval)
    {
        g_usb_cur_task_hdl[usbip_no] = (usb_hdl_t)USB_NULL;
        g_usb_semaphore_holder[usbip_no] = 0;
        return USB_SUCCESS;
    }

    return USB_ERR_NG;
#else
    return USB_SUCCESS;
#endif
}
/******************************************************************************
 End of function usb_cstd_rel_semaphore
 ******************************************************************************/
#endif  /* (BSP_CFG_RTOS_USED == 1) */


#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_cstd_usb_task
 Description     : USB driver main loop processing.
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_cstd_usb_task (void)
{
    if ( USB_HOST == g_usb_usbmode)
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
#if defined(USB_CFG_HMSC_USE)
        do
        {
#endif /* defined(USB_CFG_HMSC_USE) */
        usb_cstd_scheduler(); /* Scheduler */
        if (USB_FLGSET == usb_cstd_check_schedule()) /* Check for any task processing requests flags. */
        {
#if (BSP_CFG_RTOS_USED == 0)
            /** Use only in non-OS. In RTOS, the kernel will schedule these tasks, no polling. **/
            usb_hstd_hcd_task((usb_vp_int_t) 0); /* HCD Task */
            usb_hstd_mgr_task((usb_vp_int_t) 0); /* MGR Task */
            usb_hhub_task((usb_vp_int_t) 0); /* HUB Task */
#endif /* (BSP_CFG_RTOS_USED == 0) */
#if defined(USB_CFG_HCDC_USE) || defined(USB_CFG_HHID_USE) || defined(USB_CFG_HMSC_USE) || defined(USB_CFG_HVND_USE)

            usb_class_task();

#endif  /* defined(USB_CFG_HCDC_USE)||defined(USB_CFG_HHID_USE)||defined(USB_CFG_HMSC_USE)||defined(USB_CFG_HVND_USE) */
        }
#if defined(USB_CFG_HMSC_USE)
    }
    while (USB_FALSE != g_drive_search_lock);

#endif /* defined(USB_CFG_HMSC_USE) */
#endif /*( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )*/
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        usb_pstd_pcd_task();
#if defined(USB_CFG_PMSC_USE)
        usb_pmsc_task();
#endif /* defined(USB_CFG_PMSC_USE) */
#endif /*( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )*/
    }
} /* End of function usb_cstd_usb_task() */

/******************************************************************************
 Function Name   : usb_class_task
 Description     : Each device class task processing
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_class_task (void)
{
#if defined(USB_CFG_HMSC_USE)
    usb_utr_t utr;
    uint16_t addr;

#if (BSP_CFG_RTOS_USED == 0)
    usb_hmsc_task();                /* USB Host MSC driver task */
    usb_hmsc_strg_drive_task();     /* HSTRG Task */
#endif /* (BSP_CFG_RTOS_USED == 0) */

    if (USB_FALSE == g_drive_search_lock)
    {
        if (g_drive_search_que_cnt > 0)
        {
            g_drive_search_lock = g_drive_search_que[0];

            utr.ip = USB_IP0;
            if ((g_drive_search_lock & USB_IP_MASK) == USBA_ADDRESS_OFFSET)
            {
                utr.ip = USB_IP1;
            }

            addr = g_drive_search_lock & USB_ADDRESS_MASK;
            utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip); /* Get the USB IP base address. */

            /* Storage drive search. */
            usb_hmsc_strg_drive_search(&utr, addr, (usb_cb_t) usb_hmsc_drive_complete);
        }
    }
#endif /* defined(USB_CFG_HMSC_USE) */
#if defined(USB_CFG_HCDC_USE)
#if (BSP_CFG_RTOS_USED == 0)
    usb_hcdc_task((usb_vp_int_t) 0); /* USB Host CDC driver task */
#endif /* (BSP_CFG_RTOS_USED == 0) */
#endif /* defined(USB_CFG_HCDC_USE) */
#if defined(USB_CFG_HHID_USE)
#if (BSP_CFG_RTOS_USED == 0)
    usb_hhid_task((usb_vp_int_t) 0); /* USB Host CDC driver task */
#endif /* (BSP_CFG_RTOS_USED == 0) */

#endif /* defined(USB_CFG_HHID_USE) */

} /* End of function usb_class_task */
#endif /*(BSP_CFG_RTOS_USED == 0)*/

/******************************************************************************
 End  Of File
 ******************************************************************************/
